ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syslib/cy_syslib.h
/** \} group_syslib_macro */

/**
* \addtogroup group_syslib_data_structures
* \{
*/
/** The SysLib status code structure. */
typedef enum
{
    CY_SYSLIB_SUCCESS       = 0x00UL,    /**< Success status code */
    CY_SYSLIB_BAD_PARAM     = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x01UL,    /**< Bad parameter status code */
    CY_SYSLIB_TIMEOUT       = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x02UL,    /**< Time out status code */
    CY_SYSLIB_INVALID_STATE = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0x03UL,    /**< Invalid state status code */
    CY_SYSLIB_UNKNOWN       = CY_SYSLIB_ID | CY_PDL_STATUS_ERROR | 0xFFUL     /**< Unknown status code */
} cy_en_syslib_status_t;

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
/** The Fault configuration structure. */
typedef struct
{
    uint32_t fault;    /**< Indicates if the fault occurred */
    uint32_t r0;       /**< R0 register content */
    uint32_t r1;       /**< R1 register content */
    uint32_t r2;       /**< R2 register content */
    uint32_t r3;       /**< R3 register content */
    uint32_t r12;      /**< R12 register content */
    uint32_t lr;       /**< LR register content */
    uint32_t pc;       /**< PC register content */
    uint32_t psr;      /**< PSR register content */

    #if (CY_CPU_CORTEX_M4)
        uint32_t cfsr;         /**< CFSR register content */
        uint32_t faultType;    /**< FPU or regular fault type */

        #if ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && \
             (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
            uint32_t s0;       /**< FPU S0 register content */
            uint32_t s1;       /**< FPU S1 register content */
            uint32_t s2;       /**< FPU S2 register content */
            uint32_t s3;       /**< FPU S3 register content */
            uint32_t s4;       /**< FPU S4 register content */
            uint32_t s5;       /**< FPU S5 register content */
            uint32_t s6;       /**< FPU S6 register content */
            uint32_t s7;       /**< FPU S7 register content */
            uint32_t s8;       /**< FPU S8 register content */
            uint32_t s9;       /**< FPU S9 register content */
            uint32_t s10;      /**< FPU S10 register content */
            uint32_t s11;      /**< FPU S11 register content */
            uint32_t s12;      /**< FPU S12 register content */
            uint32_t s13;      /**< FPU S13 register content */
            uint32_t s14;      /**< FPU S14 register content */
            uint32_t s15;      /**< FPU S15 register content */
            uint32_t fpscr;    /**< FPU FPSCR register content */
        #endif /* __FPU_PRESENT */
    #endif /* CY_CPU_CORTEX_M4 */
} cy_stc_fault_frame_t;
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */

/** \} group_syslib_data_structures */

/**
* \addtogroup group_syslib_macro
* \{
*/

/** Driver major version */
#define CY_SYSLIB_DRV_VERSION_MAJOR    1

/** Driver minor version */
#define CY_SYSLIB_DRV_VERSION_MINOR    0

/** \cond INTERNAL */
/** ARM 32-bit Return error / status codes for backward compatibility.
*  Do not use them in your code.
*/
#define CY_RET_SUCCESS           (0x00u)    /* Successful */
#define CY_RET_BAD_PARAM         (0x01u)    /* One or more invalid parameters */
#define CY_RET_INVALID_OBJECT    (0x02u)    /* Invalid object specified */
#define CY_RET_MEMORY            (0x03u)    /* Memory related failure */
#define CY_RET_LOCKED            (0x04u)    /* Resource lock failure */
#define CY_RET_EMPTY             (0x05u)    /* No more objects available */
#define CY_RET_BAD_DATA          (0x06u)    /* Bad data received (CRC or other error check) */
#define CY_RET_STARTED           (0x07u)    /* Operation started, but not necessarily completed yet */
#define CY_RET_FINISHED          (0x08u)    /* Operation completed */
#define CY_RET_CANCELED          (0x09u)    /* Operation canceled */
#define CY_RET_TIMEOUT           (0x10u)    /* Operation timed out */
#define CY_RET_INVALID_STATE     (0x11u)    /* Operation not setup or is in an improper state */
#define CY_RET_UNKNOWN           ((cy_status) 0xFFFFFFFFu)    /* Unknown failure */

/** ARM 32-bit Return error / status codes for backward compatibility with the UDB components.
*  Do not use them in your code.
*/
#define CYRET_SUCCESS            (0x00u)    /* Successful */
#define CYRET_BAD_PARAM          (0x01u)    /* One or more invalid parameters */
#define CYRET_INVALID_OBJECT     (0x02u)    /* Invalid object specified */
#define CYRET_MEMORY             (0x03u)    /* Memory related failure */
#define CYRET_LOCKED             (0x04u)    /* Resource lock failure */
#define CYRET_EMPTY              (0x05u)    /* No more objects available */
#define CYRET_BAD_DATA           (0x06u)    /* Bad data received (CRC or other error check) */
#define CYRET_STARTED            (0x07u)    /* Operation started, but not necessarily completed yet */
#define CYRET_FINISHED           (0x08u)    /* Operation completed */
#define CYRET_CANCELED           (0x09u)    /* Operation canceled */
#define CYRET_TIMEOUT            (0x10u)    /* Operation timed out */
#define CYRET_INVALID_STATE      (0x11u)    /* Operation not setup or is in an improper state */
#define CYRET_UNKNOWN            ((cystatus) 0xFFFFFFFFu)    /* Unknown failure */
/** \endcond */


/*******************************************************************************
*  Data manipulation defines
*******************************************************************************/

/** Get the lower 8 bits of a 16-bit value. */
#define CY_LO8(x)               ((uint8_t) ((x) & 0xFFu))
/** Get the upper 8 bits of a 16-bit value. */
#define CY_HI8(x)               ((uint8_t) ((uint16_t)(x) >> 8u))

/** Get the lower 16 bits of a 32-bit value. */
#define CY_LO16(x)              ((uint16_t) ((x) & 0xFFFFu))
/** Get the upper 16 bits of a 32-bit value. */
#define CY_HI16(x)              ((uint16_t) ((uint32_t)(x) >> 16u))

/** Swap the byte ordering of a 16-bit value */
#define CY_SWAP_ENDIAN16(x)     ((uint16_t)(((x) << 8u) | (((x) >> 8u) & 0x00FFu)))

