ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syslib/cy_syslib.h
/** Swap the byte ordering of a 32-bit value */
#define CY_SWAP_ENDIAN32(x)     ((uint32_t)((((x) >> 24u) & 0x000000FFu) | (((x) & 0x00FF0000u) >> 8u) | \
                                (((x) & 0x0000FF00u) << 8u) | ((x) << 24u)))

/** Swap the byte ordering of a 64-bit value */
#define CY_SWAP_ENDIAN64(x)     ((uint64_t) (((uint64_t) CY_SWAP_ENDIAN32((uint32_t)(x)) << 32u) | \
                                CY_SWAP_ENDIAN32((uint32_t)((x) >> 32u))))


/*******************************************************************************
*   Memory model definitions
*******************************************************************************/
#if defined(__ARMCC_VERSION)

    /** To create cross compiler compatible code, use the CY_NOINIT, CY_SECTION, CY_UNUSED, CY_ALIGN
     * attributes at the first place of declaration/definition.
     * For example: CY_NOINIT uint32_t noinitVar;
     */
    #define CY_NOINIT           __attribute__ ((section(".noinit"), zero_init))
    #define CY_SECTION(name)    __attribute__ ((section(name)))
    #define CY_UNUSED           __attribute__ ((unused))

    /* Specifies the minimum alignment (in bytes) for variables of the specified type. */
    #define CY_ALIGN(align)     __ALIGNED(align)
    #define CY_WEAK             __weak

#elif defined (__GNUC__)

    #define CY_NOINIT           __attribute__ ((section(".noinit")))
    #define CY_SECTION(name)    __attribute__ ((section(name)))
    #define CY_UNUSED           __attribute__ ((unused))
    #define CY_ALIGN(align)     __ALIGNED(align)
    #define CY_WEAK             __attribute__ ((weak))

#elif defined (__ICCARM__)

    #define CY_PRAGMA(x)        _Pragma(#x)
    #define CY_NOINIT           __no_init
    #define CY_SECTION(name)    CY_PRAGMA(section = name)
    #define CY_UNUSED
    #define CY_ALIGN(align)     CY_PRAGMA(data_alignment = align)
    #define CY_WEAK             __weak

#else
    #error "Unsupported toolchain"
#endif  /* (__ARMCC_VERSION) */

typedef void (* cy_israddress)(void);   /**< Type of ISR callbacks */

/** \cond INTERNAL */
/** Type of ISR callbacks for backward compatibility with the UDB components. Do not use it in your code. */
typedef void (* cyisraddress)(void);
/** \endcond */

#if defined (__ICCARM__)
    typedef union { cy_israddress __fun; void * __ptr; } cy_intvec_elem;
    /** \cond INTERNAL */
    /** Type of ISR callbacks for backward compatibility with the UDB components. Do not use it in your code. */
    typedef union { cyisraddress __fun; void * __ptr; } intvec_elem;
    /** \endcond */
#endif  /* defined (__ICCARM__) */

#if !defined(NDEBUG)
    /** Max size of file name which stores the ASSERT location */
    #define CY_MAX_FILE_NAME_SIZE  (24u)
    extern char_t cy_assertFileName[CY_MAX_FILE_NAME_SIZE];  /**< Assert buffer */
    extern uint32_t cy_assertLine;                           /**< Assert line value */
#endif /* NDEBUG */

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
    #define CY_R0_Pos              (0u)    /**< Position of R0  content in fault structure */
    #define CY_R1_Pos              (1u)    /**< Position of R1  content in fault structure */
    #define CY_R2_Pos              (2u)    /**< Position of R2  content in fault structure */
    #define CY_R3_Pos              (3u)    /**< Position of R3  content in fault structure */
    #define CY_R12_Pos             (4u)    /**< Position of R12 content in fault structure */
    #define CY_LR_Pos              (5u)    /**< Position of LR  content in fault structure */
    #define CY_PC_Pos              (6u)    /**< Position of PC  content in fault structure */
    #define CY_PSR_Pos             (7u)    /**< Position of PSR content in fault structure */
    #if (CY_CPU_CORTEX_M0P)
        #define CY_CM0P_FAULT_TYPE (0xF0F1F2F3u)       /**< Flag for indication CM0P core fault */
    #elif (CY_CPU_CORTEX_M4)
        #define CY_CM4_FAULT_TYPE     (0xF4F5F6F7u)    /**< Flag for indication CM4 core fault */
        #define CY_NON_FPU_FAULT_TYPE (0xA1A2A3A4u)    /**< Flag for indication CM4 non floating point fault type */
        #if ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && \
             (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
            #define CY_FPU_FAULT_TYPE (0xA8A9AAABu)    /**< Flag for indication CM4 core floating point fault type */
            #define CY_FPSCR_IXC_Msk  (0x00000010u)    /**< Cumulative exception bit for floating-point exceptions */
            #define CY_FPSCR_IDC_Msk  (0x00000080u)    /**< Cumulative exception bit for floating-point exceptions */
            #define CY_S0_Pos         (8u)     /**< Position of FPU S0 content in fault structure */
            #define CY_S1_Pos         (9u)     /**< Position of FPU S1 content in fault structure */
            #define CY_S2_Pos         (10u)    /**< Position of FPU S2 content in fault structure */
            #define CY_S3_Pos         (11u)    /**< Position of FPU S3 content in fault structure */
            #define CY_S4_Pos         (12u)    /**< Position of FPU S4 content in fault structure */
            #define CY_S5_Pos         (13u)    /**< Position of FPU S5 content in fault structure */
            #define CY_S6_Pos         (14u)    /**< Position of FPU S6 content in fault structure */
            #define CY_S7_Pos         (15u)    /**< Position of FPU S7 content in fault structure */
            #define CY_S8_Pos         (16u)    /**< Position of FPU S8 content in fault structure */
            #define CY_S9_Pos         (17u)    /**< Position of FPU S9 content in fault structure */
            #define CY_S10_Pos        (18u)    /**< Position of FPU S10 content in fault structure */
            #define CY_S11_Pos        (19u)    /**< Position of FPU S11 content in fault structure */
            #define CY_S12_Pos        (20u)    /**< Position of FPU S12 content in fault structure */
            #define CY_S13_Pos        (21u)    /**< Position of FPU S13 content in fault structure */
            #define CY_S14_Pos        (22u)    /**< Position of FPU S14 content in fault structure */
            #define CY_S15_Pos        (23u)    /**< Position of FPU S15 content in fault structure */
            #define CY_FPSCR_Pos      (24u)    /**< Position of FPU FPSCR content in fault structure */
        #endif /* __FPU_PRESENT */
    #endif /* CY_CPU_CORTEX_M0P */

    extern cy_stc_fault_frame_t cy_faultFrame;    /**< Fault frame structure */
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */


