ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syslib/cy_syslib.h
/*******************************************************************************
* Function Name: Cy_SysLib_ExitCriticalSection
****************************************************************************//**
*
*  Re-enables interrupts if they were enabled before
*  Cy_SysLib_EnterCriticalSection() was called. The argument should be the value
*  returned from \ref Cy_SysLib_EnterCriticalSection().
*
*  \param savedIntrStatus
*   Puts the saved interrupts status returned by
*   the \ref Cy_SysLib_EnterCriticalSection().
*
*******************************************************************************/
void Cy_SysLib_ExitCriticalSection(uint32_t savedIntrStatus);

/** \cond INTERNAL */
/** Backward compatibility define for the CyDelay() API for the UDB components.
*   Do not use it in your code.
*/
#define CyDelay                   (Cy_SysLib_Delay)
/** Backward compatibility define for the CyDelayUs() API for the UDB components.
*   Do not use it in your code.
*/
#define CyDelayUs                 (Cy_SysLib_DelayUs)
/** Backward compatibility define for the CyDelayCycles() API for the UDB components.
*   Do not use it in your code.
*/
#define CyDelayCycles             (Cy_SysLib_DelayCycles)
/** Backward compatibility define for the Cy_Halt() API.
*   Do not use it in your code.
*/
#define Cy_Halt                   (Cy_SysLib_Halt)
/** Backward compatibility define for the Cy_ClearFlashCacheAndBuffer() API.
*   Do not use it in your code.
*/
#define Cy_ClearFlashCacheAndBuffer (Cy_SysLib_ClearFlashCacheAndBuffer)
/** Backward compatibility define for the Cy_SYSLIB_GetResetReason() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_GetResetReason  (Cy_SysLib_GetResetReason)
/** Backward compatibility define for the Cy_SYSLIB_GetNumHFCLKResetCause() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_GetNumHFCLKResetCause (Cy_SysLib_GetNumHfclkResetCause)
/** Backward compatibility define for the Cy_SYSLIB_ClearResetReason() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_ClearResetReason (Cy_SysLib_ClearResetReason)
/** Backward compatibility define for the Cy_SYSLIB_GetUniqueId() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_GetUniqueId     (Cy_SysLib_GetUniqueId)
/** Backward compatibility define for the Cy_SYSLIB_SoftResetCM4() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_SoftResetCM4    (Cy_SysLib_SoftResetCM4)
#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) || defined(CY_DOXYGEN)
    /** Backward compatibility define for the Cy_SYSLIB_FaultHandler() API.
    *   Do not use it in your code.
    */
    #define Cy_SYSLIB_FaultHandler (Cy_SysLib_FaultHandler)
    /** Backward compatibility define for the Cy_SYSLIB_ProcessingFault() API.
    *   Do not use it in your code.
    */
    #define Cy_SYSLIB_ProcessingFault (Cy_SysLib_ProcessingFault)
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */
/** Backward compatibility define for the Cy_SYSLIB_SetWaitStates() API.
*   Do not use it in your code.
*/
#define Cy_SYSLIB_SetWaitStates   (Cy_SysLib_SetWaitStates)
/** Backward compatibility define for the CyEnterCriticalSection() API for the UDB components.
*   Do not use it in your code.
*/
#define CyEnterCriticalSection    (Cy_SysLib_EnterCriticalSection)
/** Backward compatibility define for the CyExitCriticalSection() API for the UDB components.
*   Do not use it in your code.
*/
#define CyExitCriticalSection     (Cy_SysLib_ExitCriticalSection)
/** \endcond */

/** \} group_syslib_functions */

#if defined(__cplusplus)
}
#endif /* defined(__cplusplus) */

#endif /* _CY_SYSLIB_H_ */

/** \} group_syslib */

/* [] END OF FILE */
